# 1.构造数据--------------------------------------------------------------------
rm(list = ls())
df13_1 <- data.frame(x1=c(10.8,11.6,10.6,9.0,11.2,9.9,10.6,10.4,9.6,10.5,10.6,9.9,9.5,9.7,10.7,9.2,10.5,11.0,10.1,10.7,8.5,10.0,10.4,9.7,9.4,9.2,10.5,11.2,9.6,8.0),
                     y1=c(9.4,9.7,8.7,7.2,10.0,8.5,8.3,8.1,8.5,9.1,9.2,8.4,7.6,7.9,8.8,7.4,8.6,9.2,8.0,8.5,7.3,8.3,8.6,8.7,7.6,8.0,8.8,9.5,8.2,7.2),
                     x2=c(10.4,9.7,9.9,9.8,11.1,8.2,8.8,10.0,9.0,9.4,8.9,10.3,9.3,9.2,10.9,9.2,9.2,10.4,11.2,11.1,11.0,8.6,9.3,10.3,10.3,9.8,10.5,10.7,10.4,9.4),
                     y2=c(9.2,9.1,8.9,8.6,9.9,7.1,7.8,7.9,8.0,9.0,7.9,8.9,8.9,8.1,10.2,8.5,9.0,8.9,9.8,10.1,8.5,8.1,8.6,8.9,9.6,8.1,9.9,9.3,8.7,8.7),
                     x3=c(9.8,11.2,10.7,9.6,10.1,9.8,10.1,10.3,11.0,10.5,9.2,10.1,10.4,10.0,8.4,10.1,9.3,10.5,11.1,10.5,9.7,9.2,9.3,10.4,10.0,10.3,9.9,9.4,8.3,9.2),
                     y3=c(7.6,7.9,9.0,7.8,8.5,7.5,8.3,8.2,8.4,8.1,7.0,7.7,8.0,6.6,6.1,8.1,7.8,8.4,8.2,8.0,7.6,6.9,6.7,8.1,7.4,8.2,7.6,7.8,6.6,7.2)
)
str(df13_1)
##### 1.1变为长数据-------------------------------------------------------------
suppressPackageStartupMessages(library(tidyverse))

df13_11 <- df13_1 %>% 
  pivot_longer(cols = everything(), # 变长
               names_to = c(".value","group"),
               names_pattern = "(.)(.)"
  ) %>% 
  mutate(group = as.factor(group)) # 组别变为因子型

glimpse(df13_11) 

##### 1.2进行单因素协方差分析---------------------------------------------------
fit <- aov(y ~ x + group, data = df13_11) # 注意公式的写法，一定是把协变量放在主变量前面！
summary(fit)

##### 1.3结果可视化-------------------------------------------------------------
library(HH)
ancovaplot(y ~ x + group, data = df13_11)

###### 1.3.1ggplot2来画---------------------------------------------------------

theme_set(theme_minimal())

p1 <- ggplot(df13_11, aes(x=x,y=y))+
  geom_point(aes(color=group,shape=group))+
  geom_smooth(method = "lm",se=F,aes(color=group))+
  labs(y=NULL)
p1
p2 <- ggplot(df13_11, aes(x=x,y=y))+
  geom_point(aes(color=group,shape=group))+
  geom_smooth(method = "lm",se=F,aes(color=group))+
  facet_wrap(~group)
p2
library(patchwork)
p2 + p1 + plot_layout(guides = 'collect',widths = c(3, 1))


# 2.使用rstatix进行优雅的协方差分析---------------------------------------------

library(rstatix)
res <- anova_test(y ~ x + group, data = df13_11, type = 1)
get_anova_table(res)

"I	序贯型（Sequential）	按变量在模型中的顺序逐个加入计算，前一个变量的贡献会影响后一个变量的SS。
II	分层型（Hierarchical）	考虑其他变量的影响，但忽略高阶交互项（适用于无交互项或平衡设计）。
III	边际型（Marginal）	每个变量的SS基于其他所有变量（包括交互项）调整后的贡献（推荐用于非平衡设计或交互模型）"


