# 1.t检验的样本量计算-----------------------------------------------------------
"对于t检验
pwr.t.test(n= , d= , sig.level= , power= , type= , alternative= )

n：样本量
d：效应值，即标准化的均值之差，d = (μ1 - μ2) / σ，也就是（组1均值 - 组2均值）/ 标准差
sig.level：显著性水平，默认值0.05
power：功效
type：检验类型：两样本t检验（two.sample），单样本t检验（one.sample），配对t检验（paired），默认两样本t检验
alternative：双侧检验还是单侧检验，双侧（two.sided），单侧（less或者greater），默认双侧检验"

##### 1.1单样本t检验（样本均数和已知总体均数比较）------------------------------

"用某药治疗矽肺患者，估计可增加尿矽排出量，其标准差为25mg/L，若要求以α=0.05，β=0.1的概率，
能辨别出尿矽排出量平均增加10mg/L，问需要多少矽肺患者做实验？"
###### 1.1.1第一种方法----------------------------------------------------------
library(pwr)

pwr.t.test(d = 10/25, 
           sig.level = 0.05,
           power = 1-0.1,
           type = "one.sample",
           alternative = "greater"
)
# d是标准化效应量（Cohen's d）
# 单样本/配对样本 t 检验中，d = (x-u)/s S：样本标准差（单样本）或差值标准差（配对样本）
# alternative = "greater"是因为题干是说辨认出平均增加，所以是单侧检验，并是greater

###### 1.1.2第二种方法----------------------------------------------------------
power.t.test(delta = 10,
             sd = 25,
             sig.level = 0.05,
             power = 1-0.1,
             type = "one.sample",
             alternative = "one.sided"
)

##### 1.2两样本t检验（两样本均数比较）------------------------------------------

"比较A处理动物和B处理动物的平均血流量增加，设两处理的标准差相等。
若要求以α=0.05，β=0.1的概率，
达到能辨别出两者增加的差别是其标准差的60%，需要多少实验动物？"

# 两者增加的差别是其标准差的60%，也就是 (μ1 - μ2) / σ = 0.6
library(pwr)

pwr.t.test(d = 0.6,
           sig.level = 0.05,
           power = 1 - 0.1,
           type = "two.sample",
           alternative = "two.sided"
)


# 2.样本率和已知总体率的比较----------------------------------------------------

"已知常规方法治疗某种病的有效率是80%，现试验一种新的额治疗方法，
预计有效率是90%，设α=0.05，β=0.1，
问需要多少病例才能发现两种方法的有效率有10%的差别？"

ES.h(0.9,0.8)
pwr.p.test(h = ES.h(0.9,0.8),
           sig.level = 0.05,
           power = 1-0.1,
           alternative = "greater"
)

# 3.两独立样本率的比较----------------------------------------------------------

"甲药有效率为60%。乙药有效率为85%，现拟进一步做治疗实验，设α=0.05,1-β=0.9，
问每组需要多少病例"
##### 3.1第一种方法-------------------------------------------------------------
ES.h(0.85,0.60)
pwr.2p.test(h = ES.h(0.85,0.60),
            sig.level = 0.05,
            power = 1-0.1,
            alternative = "two.sided"
)
##### 3.2第二种方法-------------------------------------------------------------
power.prop.test(p1 = 0.85,
                p2 = 0.6,
                sig.level = 0.05,
                power = 1-0.1,
                alternative = "two.sided"
)

# 4.多样本率的比较--------------------------------------------------------------

"初步估计甲法有效率为40%，乙法50%，丙法65%，设α=0.05，β=0.1，试估计样本量？"

prob <- rbind(c(0.4, 0.5, 0.65), # 有效率
              c(0.6, 0.5, 0.35)) # 无效率
# pwr包自带的这个函数专门用于此种情况的effect size计算
ES.w2(prob/3) # 有几组就除以几，这里需要理解列联表资料的一些指标计算
pwr.chisq.test(w = ES.w2(prob/3), # effect size
               df = 2, #（3-1）*（2-1）= 2
               sig.level = 0.05,
               power = 1-0.1
)

# 5.直线相关分析----------------------------------------------------------------

"血硒与发硒含量间直线相关系数为0.8，若想在α=0.05，β=0.1的水平上
得到相关系数有统计学意义的结论，应调查多少人？"
pwr.r.test(r=0.8,
           sig.level = 0.05,
           power = 1-0.1,
           alternative = "two.sided")



