# 1.多项逻辑回归----------------------------------------------------------------
##### 1.1构造数据，并因子化-----------------------------------------------------
rm(list = ls())
library(nnet) #加载nnet包，调用multinom()函数
library(car) #加载car包，调用Anova()函数
library(data.table)  #加载data.table包，调用melt()函数
library(ggplot2)  #加载ggplot2包，用于数据可视化
library(survival) #加载survival包
str(colon) #查看数据集的样本量、变量数、各变量的类型、值标签等


colon$rx <- as.factor(colon$rx) #将rx转换为因子
colon$extent <- as.factor(colon$extent) #将extent转换为因子
colon$rx <- relevel(colon$rx, ref = "Obs") #将治疗方式中Obs作为参照
##### 1.2多项式Logistic回归-----------------------------------------------------
model <- multinom(rx ~ extent + age, data = colon) #创建多项Logistic回归模型，rx作为因变量，extent和age作为自变量
summary(model)
res <- broom::tidy(model)
res
###### 1.2.1结果解释------------------------------------------------------------

"
Call:
multinom(formula = rx ~ extent + age, data = colon)

Coefficients:
        (Intercept)    extent2    extent3    extent4         age
Lev      -1.2201500  0.9114916  1.0091878  0.4637643 0.004188627
Lev+5FU   0.1230425 -0.4012888 -0.2197006 -0.8236458 0.001756267

Std. Errors:
        (Intercept)   extent2   extent3   extent4         age
Lev       0.5507836 0.5064825 0.4829752 0.5439840 0.004755473
Lev+5FU   0.4317186 0.3762761 0.3415526 0.4278109 0.004762071

extent2	0.911	肿瘤扩散程度为2级 vs 1级时，选择Lev而非参考类别的对数几率增加0.911
age	0.004	年龄每增加1岁，选择Lev的对数几率增加0.004（影响微弱）
"

##### 1.3计算OR值---------------------------------------------------------------
OR <- exp(coef(model))
OR

##### 1.4计算OR值的95%的可信区间------------------------------------------------
OR.confi <- exp(confint(model))
OR.confi

##### 1.5获取模型预测的类别-----------------------------------------------------
pred <- predict(model, colon, type = "class")
head(pred)

##### 1.6获取模型预测的概率-----------------------------------------------------

prob <- predict(model, colon, type = "probs") # 或者使用 fitted(fit)
head(prob)

###### 1.6.1type = "response"和type = "probs"的区别-----------------------------

"
预测类型：
type = response 直接返回预测概率（即 P(Y=1)），
因为二分类问题只需要一个概率值（另一个可通过 1−P 得到）。



多项逻辑回归需要为每个类别生成一个概率值（所有类别概率之和为1）。
例如，若有3个类别（A/B/C），需输出 P(A)、P(B)、P(C)
nnet::multinom() 的 predict() 函数使用 type = probs 返回所有类别的概率矩阵
（每列对应一个类别），这是更通用的输出格式

二项逻辑回归（glm(family = binomial)）中
没有type = probs 这个参数
"

##### 1.7模型拟合优度的检验-----------------------------------------------------
chisq.test(colon$rx, pred)
###### 1.7.1此时卡方检验结果说明------------------------------------------------

# ⭐卡方检验的双重角色----------------------------------------------------------
"
卡方检验的双重角色：
(1)
独立性检验：检验两变量是否相关
H₀：变量独立（不相关）
H₁：变量相关（拒绝H₀时）
(2)
拟合优度检验：检验数据分布是否符合预期
H₀：观测分布 = 理论分布
H₁：观测分布 ≠ 理论分布
您的案例本质：

您做的是拟合优度检验（比较模型预测分布 vs 实际数据分布）
p > 0.05 表示 预测分布与实际分布无显著差异 → 模型拟合良好
"
###### 1.7.2计算伪R^2-----------------------------------------------------------
DescTools::PseudoR2(model, which = "all")

