rm(list = ls())
# 1.偏相关(partial correlation)-------------------------------------------------

##### 1.1偏相关的定义及适用情况-------------------------------------------------
"
偏相关分析是指在对其他一个或多个定量变量的影响进行控制的条件下，
分析两个定量变量之间的相互关系
目前有PPCOR和ggm两个包中都有pcor函数
最后得到的结果都是一样的
PPCOR是最屌的
"
###### 1.1.1pearson相关系数和Spearman系数的区别---------------------------------
"
pearson积差相关系数是用于衡量两个定量变量之间的线性相关程度
Spearman等级相关系数用于衡量分级定序变量之间的相关强度

"


##### 1.2构造数据(只是为了和R实战数据一致)--------------------------------------
states<- state.x77[,1:6]
States <- as.data.frame(states)
States <- States[,c(1,5,2,3,6)]


##### 1.3 ppcor-----------------------------------------------------------------
library(ppcor)
ppcor::pcor(States)
# 会得到一个偏相关分析表
# 两两关系都是控制其余变量的条件下得到的偏相关系数

"
$estimate
           Population      Murder      Income  Illiteracy     HS Grad
Population  1.0000000  0.34627237  0.31327745 -0.14771922 -0.18061967
Murder      0.3462724  1.00000000  0.03937915  0.59897405 -0.05232753
Income      0.3132774  0.03937915  1.00000000 -0.08325202  0.52439361
Illiteracy -0.1477192  0.59897405 -0.08325202  1.00000000 -0.38150422
HS Grad    -0.1806197 -0.05232753  0.52439361 -0.38150422  1.00000000

$p.value
           Population       Murder       Income   Illiteracy      HS Grad
Population 0.00000000 1.711252e-02 0.0320178333 3.217384e-01 0.2243870366
Murder     0.01711252 0.000000e+00 0.7927031319 8.671525e-06 0.7268498564
Income     0.03201783 7.927031e-01 0.0000000000 5.779747e-01 0.0001546294
Illiteracy 0.32173843 8.671525e-06 0.5779746875 0.000000e+00 0.0081465765
HS Grad    0.22438704 7.268499e-01 0.0001546294 8.146576e-03 0.0000000000

$statistic
           Population     Murder     Income Illiteracy    HS Grad
Population   0.000000  2.4760489  2.2129240  -1.001922 -1.2318945
Murder       2.476049  0.0000000  0.2643684   5.017730 -0.3515053
Income       2.212924  0.2643684  0.0000000  -0.560417  4.1313430
Illiteracy  -1.001922  5.0177304 -0.5604170   0.000000 -2.7686058
HS Grad     -1.231895 -0.3515053  4.1313430  -2.768606  0.0000000
"
##### 1.4 ggm-------------------------------------------------------------------
# 这个包稍微弱了一点儿
library(ggm)
library(psych)
colnames(States)
ggm::pcor(c(1,2,3,4,5), cov(States))
# [1] 0.3462724
# 控制第3.4.5列变量得到第一列和第二列变量之间的偏相关系数

