# 1.ROC曲线的定义---------------------------------------------------------------
#ROC曲线的横坐标是假阳性率，纵坐标是真阳性率
#计算很多个假阳性率和真阳性率，然后就可以在坐标轴上画出很多个点，
#把这些点连接成线就是ROC曲线了

# 2.构建数据--------------------------------------------------------------------
set.seed(20220840)
ca125_1 <- c(rnorm(10,80,20),rnorm(20,50,10))#生成两组数据并将其合并
ca125_1
##### 2.1模拟真实结果-----------------------------------------------------------
#景——假定前10个人是肿瘤，后20个人是非肿瘤
outcome <- c(rep(c("肿瘤","非肿瘤"),c(10,20)))
outcome

df <- data.frame(`outcome`=outcome,
                 `ca125`=ca125_1
)
psych::headtail(df)

##### 2.2模拟诊断结果-----------------------------------------------------------
df1 <- transform(df, pred = ifelse(ca125>60,"猜他是肿瘤","猜他不是肿瘤"))
df1
##### 2.3生成四联表-------------------------------------------------------------

xtabs(~outcome+pred,data = df1)
#真阳性率 = 9 / (1+9) = 0.9
#假阳性率 = 5 / (15+5) = 0.25

##### 2.4如果我们感兴趣的是确定为非肿瘤的能力呢---------------------------------

# 此时四格表还是这个四格表
xtabs(~outcome+pred,data = df1)
#假阳性率 = 1 / (1+9) = 0.1
#真阳性率 = 15 / (15+5) = 0.75
