
# ⭐多变量数据的基本概念--------------------------------------------------------
"
在医学研究中，尤其在临床试验中，每个观察对象记录的观察结果通常有多个反应变量
（response variables）。例如，血压记录有收缩压、舒张压、脉压等；血脂记录有胆固醇
脂、甘油三酯、磷脂、未脂化脂肪酸等；心功能、肺功能、微循环的检测记录项目则可多达十
几个乃至几十个，这种有多个反应变量的数据称为多变量数据（multivariate data）。这里要
注意多变量数据和多因素试验的区别。多因素试验指有多个干预因素（分组因素）的试验，尽
管析因设计方差分析和正交设计方差分析可以分析多个试验因素的作用，但试验结果只有一个
反应变量，仍然是单变量数据（univariate data）

多元统计分析方法主要包括以下几种:
聚类分析、主成分分析、因子分析、判别分析、结构方程模型等
"

# 1.统计描述--------------------------------------------------------------------






















































