#mice()：对缺失值进行插补
#with()：对多个插补后的结果进行分析，注意这里的with()是mice包里的函数
#pool()：对分析结果进行汇总

#加载数据和R包------------------------------------------------------------------
library(mice)

str(nhanes)

#多种使用方法------------------------------------------------------------------

#研究目的:使用age、bmi、hyp预测chl的值，因为chl这个变量是连续型变量
#此时我们可以使用lm()建立多元线性回归模型
summary(lm(chl ~ age + bmi + hyp, data = nhanes))
#lm()默认的对缺失值的默认操作就是直接删除
#我们可以修改一下，但是会报错
lm(chl ~ age + bmi + hyp, data = nhanes, na.action = na.fail())

#mice对数据进行多重插补---------------------------------------------------------
#插补
#分析
#汇总

# 进行插补，默认插补5次--------------------------------------------------------
imp <- mice(nhanes, seed = 123, print = FALSE, m=5) #print = FALSE就是让控制台闭嘴做事
# 对5个结果进行分析--------------------------------------------------------
# chl是连续型，所以用lm；二分类就用glm
fit <- with(imp, lm(chl ~ age + bmi + hyp))
# 汇总分析结果---------------------------------------------------------------------
est1 <- pool(fit)
# 查看汇总结果---------------------------------------------------------------------
summary(est1)
# 提取第2次插补后的回归分析结果---------------------------------------------------------------------
summary(fit$analyses[[2]])
#tidy用法---------------------------------------------------------------------
est2 <- nhanes |>
  mice(seed = 123, print = FALSE) |>
  with(lm(chl ~ age + bmi + hyp)) |>
  pool()

summary(est2)
#提取插补结果---------------------------------------------------------------------
imputed_df <- mice::complete(imp, action = 2)#mice包中complete函数，特别指定
#提取生成的5套插补后数据中的第2套
md.pattern(imputed_df,plot = F) # 没有缺失值了

#   age bmi hyp chl  
# 25  1   1   1   1 0
#     0   0   0   0 0
#结果解释
# 25 有25行数据完全无缺失（所有变量均观测到）
# 1 1 1 1：4个变量（age, bmi, hyp, chl）在这些行中(均有值)
# 
# 0：这些行(无缺失值计数)